In [1]:
#pip install pandas
#pip install numpy
#pip install matplotlib

In [2]:
import pandas as pd

In [5]:
#help(pd)

In [35]:
df = pd.read_csv("demo.csv" ,names=["user name","amount" , "id", "date"])

In [36]:
df.head(6)

         user name    amount          id        date
0  Sylvester Sykes   9014.58  1009014458  2018-10-24
1  Brandon Wheeler   8590.93  1006789262  2018-10-24
2        Wing Roth  25660.92  1025660292  2018-10-24
3     Zachary Roth   9178.23  1009178723  2018-10-24
4      Otto Barron   6754.46  1006754446  2018-10-24
5     Gavin Mcleod  10447.75  1010447375  2018-10-24

In [37]:
df.tail(3)

            user name    amount          id        date
96  Nathaniel Sanford  73541.17  1007354117  2018-08-05
97      Drew Cummings  72015.79  1007201579  2019-08-26
98  Christopher Morto  25694.88  8000061942  2019-12-08

In [20]:
#df

In [24]:
#df["new_column"] = True

df["new_column"] = 1                              #Literal

df["new_column2"] = df["amount"]*2       # transformacion

In [39]:
# Como acceder a la columna (serie)
df["user name"]

#df.user name

0       Sylvester Sykes
1       Brandon Wheeler
2             Wing Roth
3          Zachary Roth
4           Otto Barron
            ...
94        Jakeem Bowers
95         Ross Pittman
96    Nathaniel Sanford
97        Drew Cummings
98    Christopher Morto
Name: user name, Length: 99, dtype: object

In [40]:
from random import random

In [41]:
random()

0.13248857891383947

In [49]:
a_func = lambda fila : fila * random()

df["random_amount"]  = df.amount.apply(a_func)

In [50]:
df["division"] = df.amount / df.random_amount

Sepremos el nombre por nombre y apellido

In [70]:
df = pd.read_csv("demo.csv" ,names=["user name","amount" , "id", "date"])

In [59]:
a_func1 = lambda linea : linea.split(" ")[0]
a_func2 = lambda linea : linea.split(" ")[1]

df["name"] = df["user name"].apply(a_func1)
df["lastName"] = df["user name"].apply(a_func2)

In [71]:
df

            user name    amount          id        date
0     Sylvester Sykes   9014.58  1009014458  2018-10-24
1     Brandon Wheeler   8590.93  1006789262  2018-10-24
2           Wing Roth  25660.92  1025660292  2018-10-24
3        Zachary Roth   9178.23  1009178723  2018-10-24
4         Otto Barron   6754.46  1006754446  2018-10-24
..                ...       ...         ...         ...
94      Jakeem Bowers  21281.47  1021281747  2018-11-29
95       Ross Pittman  72924.95  8000022770  2018-07-23
96  Nathaniel Sanford  73541.17  1007354117  2018-08-05
97      Drew Cummings  72015.79  1007201579  2019-08-26
98  Christopher Morto  25694.88  8000061942  2019-12-08

[99 rows x 4 columns]

In [75]:
a_func1 = lambda linea : (linea.split(" ")[0],linea.split(" ")[1])


df["x"] = df["user name"].apply(a_func1)

#df

In [78]:
df = pd.read_csv("demo.csv" ,names=["user name","amount" , "id", "date"])

In [84]:
df[["name" ,"lastName"]] = df["user name"].str.split(' ', expand=True )

#df

####  Apply Map

In [85]:
import numpy as np

In [86]:
np.nan

nan

In [93]:
random()

0.09091212376571067

In [104]:
import random
#from random import rnd

random.seed(10)

In [107]:
ponerNulos = lambda x :  np.nan if (  random.random() < 0.3) else x

df1 = df.applymap(ponerNulos)

#### dropna

In [111]:
df1.dropna(inplace=True)

In [112]:
df1

          user name    amount            id        date      name lastName
5      Gavin Mcleod  10447.75  1.010447e+09  2018-10-24     Gavin   Mcleod
8       Ryan Wilson   8587.07  1.008587e+09  2018-10-24      Ryan   Wilson
16     Travis Terry  76812.81  1.007681e+09  2018-10-24    Travis    Terry
22  Geoffrey Adkins  66865.65  8.000041e+09  2018-10-24  Geoffrey   Adkins
23    Yoshio Daniel   6099.00  1.000006e+09  2018-10-24    Yoshio   Daniel
25   Dustin Brennan   6524.38  1.006525e+09  2019-01-02    Dustin  Brennan
40    Rafael Farmer   9997.35  1.009998e+09  2019-01-02    Rafael   Farmer
52   Quentin Cannon  92484.59  1.009248e+09  2018-09-23   Quentin   Cannon
65   William Burton   9116.43  1.009117e+09  2019-08-30   William   Burton
66       Sean Downs  61470.61  1.006147e+09  2019-01-31      Sean    Downs
67       Avram Wall  62559.80  1.006256e+09  2019-01-31     Avram     Wall
79       Alec Salas  76890.58  1.007689e+09  2018-05-22      Alec    Salas

#### reset index

In [126]:
df = pd.read_csv("demo.csv" ,names=["user name","amount" , "id", "date"])

ponerNulos = lambda x :  np.nan if (  random.random() < 0.3) else x

df1 = df.applymap(ponerNulos).dropna()

In [127]:
df1

            user name    amount            id        date
14      Bruno Douglas  86169.87  1.008617e+09  2018-10-24
16       Travis Terry  76812.81  1.007681e+09  2018-10-24
17       Sean Wallace  76525.18  1.007653e+09  2018-10-24
23      Yoshio Daniel   6099.00  1.000006e+09  2018-10-24
24         Cyrus Reid  92331.14  1.009233e+09  2018-10-24
33    Timothy Sargent   9978.62  1.009978e+09  2019-01-02
35        Paul Nguyen  10135.53  8.000035e+09  2019-01-02
36      Nathan Porter   8491.40  1.008492e+09  2019-01-02
40      Rafael Farmer   9997.35  1.009998e+09  2019-01-02
47     Armando Waters  80605.79  8.000069e+09  2018-09-23
55       Jesse Fowler  71127.16  1.007113e+09  2018-09-23
57        Kuame Klein   6228.84  1.006228e+09  2019-08-30
58       Hedley Brock  25484.22  1.025484e+09  2019-08-30
59   Preston Copeland   6846.54  1.006846e+09  2019-08-30
66         Sean Downs  61470.61  1.006147e+09  2019-01-31
74           Ali Rosa  97798.93  1.009780e+09  2019-01-31
75     Kenyon Blevins  80485.96  1.008049e+09  2019-01-31
81       Reece Sharpe  77430.66  1.007743e+09  2018-05-22
91  Forrest Mcfarland  68966.65  1.006897e+09  2018-11-29
93       Tarik Moreno  88177.42  1.008818e+09  2018-11-29
95       Ross Pittman  72924.95  8.000023e+09  2018-07-23

In [130]:
df1.reset_index(drop=True , inplace=True)

In [138]:
# Ejemplo cambios mutables

In [139]:
var = np.array([1,2,3,4,5,6])
np.random.shuffle(var)

#### Esquema de datos

In [140]:
df1.dtypes

user name     object
amount       float64
id           float64
date          object
dtype: object

In [142]:
df.date = pd.to_datetime(df.date , format="%Y-%m-%d")

In [145]:
df.dtypes

            user name    amount          id       date
0     Sylvester Sykes   9014.58  1009014458 2018-10-24
1     Brandon Wheeler   8590.93  1006789262 2018-10-24
2           Wing Roth  25660.92  1025660292 2018-10-24
3        Zachary Roth   9178.23  1009178723 2018-10-24
4         Otto Barron   6754.46  1006754446 2018-10-24
..                ...       ...         ...        ...
94      Jakeem Bowers  21281.47  1021281747 2018-11-29
95       Ross Pittman  72924.95  8000022770 2018-07-23
96  Nathaniel Sanford  73541.17  1007354117 2018-08-05
97      Drew Cummings  72015.79  1007201579 2019-08-26
98  Christopher Morto  25694.88  8000061942 2019-12-08

[99 rows x 4 columns]